Documents/ПоступлениеМатериалов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ПоступлениеМатериалов</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Управленческий</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПоступлениеМатериалов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Материалы</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидМеталла</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидМеталла</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НДС</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Enums/СтавкиНДС.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтавкиНДС</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>БезНДС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС20</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС10</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НДС0</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Documents/ПоступлениеМатериалов/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПоступлениеМатериаловВесПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПоступлениеМатериалов.ТекущиеДанные;
	СтрокаТаб.Сумма = СтрокаТаб.Вес * СтрокаТаб.Цена;
	
	//РаботаСДокументами.РассчетСуммы(СтрокаТаб);
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеМатериаловЦенаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПоступлениеМатериалов.ТекущиеДанные;
	СтрокаТаб.Сумма = СтрокаТаб.Вес * СтрокаТаб.Цена;
	
	//РаботаСДокументами.РассчетСуммы(СтрокаТаб);
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеМатериаловСуммаПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПоступлениеМатериалов.ТекущиеДанные;
	СтрокаТаб.Сумма = СтрокаТаб.Вес * СтрокаТаб.Цена;
	
	//РаботаСДокументами.РассчетСуммы(СтрокаТаб);
КонецПроцедуры

&НаКлиенте
Процедура ПоступлениеМатериаловНДСПриИзменении(Элемент)
	СтрокаТаб = ЭтаФорма.Элементы.ПоступлениеМатериалов.ТекущиеДанные;
	 
	 БезНДС = ПредопределенноеЗначение("Перечисление.СтавкиНДС.БезНДС");
	 НДС0 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС0");
	 НДС10 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС10");
	 НДС20 = ПредопределенноеЗначение("Перечисление.СтавкиНДС.НДС20");
	 	
	Если СтрокаТаб.НДС = БезНДС Или СтрокаТаб.НДС = НДС0 Тогда
			СтрокаТаб.СуммасНДС = 0;
		Иначе
			СтавкаСтрокой = Строка(СтрокаТаб.НДС);
			СтавкаЧислом = Число(СтрЗаменить(СтавкаСтрокой, "%", ""));
			
			СтрокаТаб.СуммасНДС = (СтрокаТаб.Количество * СтрокаТаб.Цена) * (СтавкаЧислом / 100);
		КонецЕсли;
КонецПроцедуры
